manu19901991/STM32CubeWBA/Projects/NUCLEO-WBA52CG/Applications/BLE/BLE_p2pRouter/STM32_WPAN/App/app_ble.c
/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

uint8_t BLECB_Indication( const uint8_t* data,
                          uint16_t length,
                          const uint8_t* ext_data,
                          uint16_t ext_length )
{
  uint8_t status = 1;
  BleEvtPacket_t *phcievt;
  uint16_t total_length = (length+ext_length);
  /* Unused parameter */
  (void)ext_data;

  if (data[0] == HCI_EVENT_PKT_TYPE)
  {
    APP_BLE_ResumeFlowProcessCb.Callback = BLE_ResumeFlowProcessCallback;
    if (AMM_Alloc (CFG_AMM_VIRTUAL_APP_BLE,
                   DIVC((sizeof(BleEvtPacketHeader_t) + total_length), sizeof (uint32_t)),
                   (uint32_t **)&phcievt,
                   &APP_BLE_ResumeFlowProcessCb) != AMM_ERROR_OK)
    {
      APP_DBG_MSG("Alloc failed\n");
      status = 1;
    }
    else if (phcievt != (BleEvtPacket_t *)0 )
    {
      phcievt->evtserial.type = HCI_EVENT_PKT_TYPE;
      phcievt->evtserial.evt.evtcode = data[1];
      phcievt->evtserial.evt.plen  = data[2];
      memcpy( (void*)&phcievt->evtserial.evt.payload, &data[3], data[2]);
      LST_insert_tail(&BleAsynchEventQueue, (tListNode *)phcievt);
      UTIL_SEQ_SetTask(1 << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SCH_PRIO_0);
      status = 0;
    }
  }
  else if (data[0] == HCI_ACLDATA_PKT_TYPE)
  {
    status = 0;
  }
  return status;
}

void NVMCB_Store( const uint32_t* ptr, uint32_t size )
{
  (void)ptr;
  (void)size;

  /* Call SNVMA for storing - Without callback */
  SNVMA_Write (APP_BLE_NvmBuffer,
               BLE_NvmCallback);
}
/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
static uint8_t analyse_ext_adv_report(hci_le_extended_advertising_report_event_rp0 *p_ext_adv_report)
{
  uint8_t status;

  if ((display_filter != 0) && HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0010))
  {
    status = 1;
  }
  else
  {
    status = 0;

    l_buff_pos = 0;
    memset(&l_buff[l_buff_pos], 0, L_BUFF_SIZE);

    l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos,
                            "%02X:%02X:%02X:%02X:%02X:%02X | "
                            ,p_ext_adv_report->Address[5], p_ext_adv_report->Address[4]
                            ,p_ext_adv_report->Address[3] ,p_ext_adv_report->Address[2]
                            ,p_ext_adv_report->Address[1] ,p_ext_adv_report->Address[0]);

    if (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0010))
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE, "LEGACY   |");
    }
    else
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE, "EXTENDED |");
    }

    l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "%4d | ",(int8_t)p_ext_adv_report->RSSI );

    if (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0001))
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "CONN |");
    }
    else
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "     |");
    }

    if (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0002))
    {
      if (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0008))
      {
        l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "SCAN RSP |");
      }
      else
      {
        l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "SCAN     |");
      }
    }
    else
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "         |");
    }

    l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "%3d | ",p_ext_adv_report->Data_Length );

    if (p_ext_adv_report->Advertising_SID != 0xFF)
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "%2d | ",p_ext_adv_report->Advertising_SID );
    }

    if (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0020))
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "more data   | ");
    }
    else if (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0040))
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "trunc data | ");
    }
    else
    {
      /* Nothing to do */
    }

//    if( !(HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0010)) && /* extended */
//        (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0001)) )   /* connectable */
//    {
//      uint8_t i, adtype, adlength;
//
//      i = 0;
//      while ( i < p_ext_adv_report->Data_Length )
//      {
//        adlength = p_ext_adv_report->Data[i];
//        adtype = p_ext_adv_report->Data[i + 1];
//
//        if ( adtype == AD_TYPE_MANUFACTURER_SPECIFIC_DATA )
//        {
//          if ( (adlength >= 7) &&
//               (p_ext_adv_report->Data[i + 4] == 0x02) && /* blueST v2*/
//               (p_ext_adv_report->Data[i + 6] == 0x83))   /* p2pServer application */
//          {
//            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "p2pServer detected, address recorded to connect. | ");
//
//            bleAppContext.a_deviceServerExtendedBdAddr[0] = p_ext_adv_report->Address[0];
//            bleAppContext.a_deviceServerExtendedBdAddr[1] = p_ext_adv_report->Address[1];
//            bleAppContext.a_deviceServerExtendedBdAddr[2] = p_ext_adv_report->Address[2];
//            bleAppContext.a_deviceServerExtendedBdAddr[3] = p_ext_adv_report->Address[3];
//            bleAppContext.a_deviceServerExtendedBdAddr[4] = p_ext_adv_report->Address[4];
//            bleAppContext.a_deviceServerExtendedBdAddr[5] = p_ext_adv_report->Address[5];
//            bleAppContext.deviceServerExtendedAddressType = p_ext_adv_report->Address_Type;
//
//            bleAppContext.deviceServerFound = 0x01;
//          }
//        }
//        i += adlength + 1;
//      }
//    }

    l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "\n");

    APP_DBG_MSG("%s",l_buff);
  }

  return status;
}

/* USER CODE END FD_WRAP_FUNCTIONS */
